Revit 2027 API
ParameterTypeId.DividedSurfaceDisplayPatternLines Property
 "Pattern Lines"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId DividedSurfaceDisplayPatternLines { get; }
Public Shared ReadOnly Property DividedSurfaceDisplayPatternLines As ForgeTypeId
	Get
public:
static property ForgeTypeId^ DividedSurfaceDisplayPatternLines {
	ForgeTypeId^ get ();
}
static member DividedSurfaceDisplayPatternLines : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace